Revit 2027 API
AlphanumericRevisionSettings.IsValid Method
 Determines whether the AlphanumericRevisionSettings object is in a valid state.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsValid()
Public Function IsValid As Boolean
public:
bool IsValid()
member IsValid : unit -> bool
Return Value
Boolean
 True if the settings are valid.
Remarks
 The AlphanumericRevisionSettings should have at least one string in its revision numbering sequence.
See Also
Reference
AlphanumericRevisionSettings Class
Autodesk.Revit.DB Namespace